---
kind: method
id: M:Autodesk.Revit.DB.VertexIndexPairArray.Append(Autodesk.Revit.DB.VertexIndexPair)
source: html/c427647a-9d2a-3b98-3c9e-6e1a6697fffd.htm
---
# Autodesk.Revit.DB.VertexIndexPairArray.Append Method

## Syntax (C#)
```csharp
public virtual void Append(
	VertexIndexPair item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.VertexIndexPair`)